Revit 2026 API

# ConceptualConstructionOpeningType Enumeration

---

ConceptualConstructionType values for Openings.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ConceptualConstructionOpeningType
```
```vb
Public Enumeration ConceptualConstructionOpeningType
```
```cpp
public enum class ConceptualConstructionOpeningType
```
```fsharp
type ConceptualConstructionOpeningType
```

| Member name | Value | Description |
| --- | --- | --- |
| Air | 0 | Air Opening |
| InvalidOpeningTypeConstruction | -1 | Invalid value/not set Opening Type Construction |
| NumOpeningTypeConstruction | 1 | Total Number of Opening Type Constructions |

#### Reference

Autodesk.Revit.DB.Analysis Namespace